{
    "content-1":{
        "title": "The LEVEL-UP CIW (Correctional Institute for Women)",
        "content": "The Polytechnic University of the Philippines (PUP), through the Department of Psychology, signed a Memorandum of Understanding (MOU) with the Correctional Institution for Women (CIW), in response to its commitment to provide an array of extension programs and psychological services. Leading an Empowering Valuable Life: Uplifting and Protecting CIW extension initiative is part of the University's Life Skills Program (LSP), which provides psychological services to officials of institutions catering to the vulnerable sectors."
    },
    "content-2":{
        "title": "Barangay 629",
        "content": "The initiative to continue rendering extension services for Barangay 629 has been spearheaded by the College of Social Sciences  and Development Dean, Dr. Raul Roland Sebastian. Together with the departments under CSSD Hagkanlungan, programs for Brgy. 629 was put into place. The Department of Psychology contributes to imparting skills and expertise on mental health among barangay officials and residents."
    },
    "content-3":{
        "title": "ICAN Center for Children Philippines",
        "content": "The Polytechnic University of the Philippines (PUP), through the CSSD Hagkanlungan, signed a Memorandum of Understanding (MOU) with ICAN Foundation, in response to its commitment to provide an array of extension programs and psychological services. Recently, the Department of Psychology assisted the institution in its Strategic Planning and conducted Job Analysis, Outreach, and Consultation Services."
    },
    "content-4":{
        "title": "Joly Homes Foundation",
        "content": "The PUP – Salin Kaalaman tungo sa Kaunlaran (SKTK) and CSSD Hagkanlungan Extension Services program launched a Capability Development Project for South Ville 7 Credit Cooperative Officers with the assistance of Joly Homes Foundation Inc. This project was conducted in seven separate activities starting from August to November 2022. This was implemented by the PUP College of Social Sciences and Development (CSSD) and the focal persons for each department. The target group is Southville 7 Credit Cooperative Officers, volunteer staff, and active members of a pilot community. The Department of Psychology offered its expert service for the institution by imparting knowledge and skills on stress management, which we believe is an important skill needed to maintain a healthy well-being amidst various work and personal responsibilities."
    },
    "content-5":{
        "title": "Cooperative Union of Mandaluyong City",
        "content": "THE PUP EXTENSION MANAGEMENT OFFICE, SALIN KAALAMAN TUNGO SA KAUNLARAN, conducted a capability development program for the member Primary Cooperative Trainers of Cooperative Union of Mandaluyong City (CUMC).\nParticipants who graduated in this SKTK PROGRAM are the potential candidate to be the participants of Training or trainers of CUMC.\nIn here, The CSSD Psychology Department was in charge of the lecture entitled Personality Development."
    }
    
}