{
    "content-1":{
        "title": "",
        "content": "The Memorandum of Agreement was signed by the Polytechnic University of the Philippines (PUP) officials and Abo Akademi University (AAU) representative Dr. Peter Nynas. It was attended by the Dean of the College of Social Sciences and Development (CSSD), Dr. Raul Roland Sebastian; the Department of Psychology Chairperson, Asst. Prof. Lorraine Charmayne Manansala; department heads from CSSD; and officials from the PUP Office of International Affairs."
    },
    "content-2":{
        "title": "",
        "content": "The Memorandum of Agreement was signed by the Polytechnic University of the Philippines (PUP) officials and Abo Akademi University (AAU) representative Dr. Peter Nynas. It was attended by the Dean of the College of Social Sciences and Development (CSSD), Dr. Raul Roland Sebastian; the Department of Psychology Chairperson, Asst. Prof. Lorraine Charmayne Manansala; department heads from CSSD; and officials from the PUP Office of International Affairs."
    },
    "content-3":{
        "title": "",
        "content": "PUP and AAU encourage academic exchange and collaboration to advance teaching and research in their respective institutions. Now therefore, for and in consideration of the foregoing premises and the terms and conditions both universities have mutually agreed to have an exchange of online lectures, collaboration on research projects, conduct webinars, conferences, talk shows, and other related activities, as well as the exchange of academic materials, publications, data and information."
    },
    "content-4":{
        "title": "",
        "content": "PUP and AAU encourage academic exchange and collaboration to advance teaching and research in their respective institutions. Now therefore, for and in consideration of the foregoing premises and the terms and conditions both universities have mutually agreed to have an exchange of online lectures, collaboration on research projects, conduct webinars, conferences, talk shows, and other related activities, as well as the exchange of academic materials, publications, data and information."
    },
    "content-5":{
        "title": "",
        "content": "Chandigarh University invited Prof. Jonna Karla C. Bien and Prof. Felicitas Trinidad from the College of Social Sciences and Development, Department of Psychology to be part of the International Faculty Development Program held in Chandigarh University, India last July 4-8, 2022."
    },
    "content-6":{
        "title": "",
        "content": "Chandigarh University invited Prof. Jonna Karla C. Bien and Prof. Felicitas Trinidad from the College of Social Sciences and Development, Department of Psychology to be part of the International Faculty Development Program held in Chandigarh University, India last July 4-8, 2022."
    },
    "content-7":{
        "title": "",
        "content": "“Isko at Iska: Thinking Out of the Box, Thinking Global!” is a proposed Internationalization Program for faculty members and students at the Polytechnic University of the Philippines initiated by the Department of Psychology, College of Social Sciences and Development. This recognizes the importance of further enhancing its academic services as it leaps in strengthening its international image and reputation. As it goes global, it aims to integrate an intercultural dimension into teaching, learning, research, and service functions."
    },
    "content-8":{
        "title": "",
        "content": "“Isko at Iska: Thinking Out of the Box, Thinking Global!” is a proposed Internationalization Program for faculty members and students at the Polytechnic University of the Philippines initiated by the Department of Psychology, College of Social Sciences and Development. This recognizes the importance of further enhancing its academic services as it leaps in strengthening its international image and reputation. As it goes global, it aims to integrate an intercultural dimension into teaching, learning, research, and service functions."
    },
    "content-9":{
        "title": "",
        "content": "United People Global and Polytechnic University of the Philippines conducted a webinar about Sustainable Development Goals (SDGs). The PUP Department of Psychology faculty members as the invited speakers discussed SDG numbers 3,4, and 5 as part of the agreed activities on the academic exchange and collaboration to advance teaching and research in their respective institutions. This event was attended by faculty members and students from various universities."
    }
}