{
    "content-1":{
        "title": "Institutional Development Plan",
        "content": "With a focus on knowledge production and ingraining the culture of research in the university, Dr. De Guzman's Eight-Point Agenda serves as the foundation for the PUP 2018-2020 Institutional Development Plan. The university's administration under Dr. De Guzman took the initiative to increase knowledge output by restructuring academic disciplines and programs across multiple colleges in the university.<br><br>The National Polytechnic University will be built on the pillars that Dr. De Guzman laid, corresponding to the current university president Dr. Manuel M. Muhi. The principal goal of President Muhi's Ten Pillars or Sampung Haligi was to restructure PUP into a National Polytechnic University that could compete internationally."
    },
    "content-2":{
        "title": "ISO 9001: 2015 Quality Management System",
        "content": "The Polytechnic University of the Philippines received its ISO 9001: 2015 Certification from SOCOTEC Certification UK in December 2018, paving the way for it to become a globally competitive and reputable educational institution. In order to boost the university's overall performance and foster breakthrough change, innovation, and reorganization, certain operational processes were evaluated and thus a quality management system has been established. One of the most widely used standards to guarantee the quality of its products and services is ISO 9001: 2015. It is reserved for institutions that demonstrate the capacity to develop consistently excellent services while still meeting regulatory standards. The academic sector of the institution as well as its operational procedures and services are all integrated with its exceptional Quality Management System."
    },
    "content-3":{
        "title": "PUP Quality Assurance Center",
        "content": ""
    },
    "content-4":{
        "title": "College of Social Sciences and Development",
        "content": "The College of Social Sciences and Development (CSSD) strives to deliver social science education of the highest standard. The College works to create knowledge by doing pertinent research in various social science disciplines involving a range of social issues and concerns. The College created a four-year Action Plan based on the Ten Pillars of President Muhi and the 2020–2024 Institutional Development Plan that aims to re-engineer PUP with responsive and creative curricula and pedagogy. The College operationalized the Ten Pillars and incorporated it into the future programs and activities of CSSD during the University-Wide Action Planning Workshop conducted on November 5–10, 2020."
    }
    
}