{
    "content-1":{
        "title": "",
        "content": "Relevant to Teaching and learning, the Bachelor of Science in Psychology Program pledges to the University’s mission of offering industry-oriented curricula that produce highly-skilled professionals with managerial and technical capabilities, and a strong sense of public service for nation building; employees with a high level of professionalism; and establishing a presence in the international academic community. This is done through the utilization of inter and multidisciplinary approaches, and employing flexible learning modalities."
    },
    "content-2":{
        "title": "",
        "content": "Furthermore, the Psychology Program, ensures to achieve its slogan of providing inclusive and equitable quality education and promote lifelong learning opportunities through a re-engineered polytechnic university. Thus, be it learning in a classroom, at home, or through the Internet, the Program is designed to adapt to students’ needs and living conditions."
    },
    "content-3":{
        "title": "",
        "content": "Abo Akademi University Dean of the Faculty of Science Dr. Peter Nynas conducted a workshop on Understanding and Using Q-Methodology: Logic and Practice as part of the agreed activities as part of the academic exchange and collaboration to advance teaching and research in their respective institutions. Attended by the PUP College of Social Sciences and Development Chairpersons, Faculties and Students."
    },
    "content-4":{
        "title": "",
        "content": "The College of Social Sciences and Development (CSSD) celebrated its month-long foundation anniversary with a series of noteworthy activities. A Memorandum of Understanding (MOU) was signed with CSSD officials, the Office of International Affairs, and Dr. Peter Nynäs as part of the celebration. A future research collaboration with CSSD Department of Psychology and Abo Akademi University is planned for 2023, which will be extended to the Young Adults Religiosity Study in the Philippines. The College is keen on building broader partnerships with various universities and colleges to boost its international presence and expand collaborative knowledge production among its students and faculty. With the personal visit of Dr. Peter Nynäs, Dean of the Faculty of Psychology and Theology at Finland’s Abo Akademi University, CSSD also took the opportunity to conduct a Masterclass on Q-methodology. The goal is to equip the college faculty with fundamental knowledge in administering the Faith Q-Set, which attempts to understand the religiosity of young people. The college participants were also given simulations of how Q-methodology is carried out"
    },
    "content-5":{
        "title": "",
        "content": "Exposing Faculty participants in the field helps Professors in terms of instruction duties. Exposure to the larger community, facilitating connections, engagement and socialization keeps faculty abreast of the mental health needs of stakeholders as well as developments in the field."
    },

    "content-6":{
        "title": "",
        "content": "The College of Social Sciences and Development - Department of Psychology conducts an Interdisciplinary Forum to assist its students as well as its faculty in accessing information on current issues that affect the nation, especially amidst the pandemic, through the conduct of webinars."
    }
    
}
